tools/perf/jmeter/S1-participants.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  회차 1 — S1-participants

  대상 : GET /api/auth/participants  (게이트웨이 8080 → user-service)
  가설 : members(role, status) 인덱스가 없어서 요청마다 10만 행 COUNT 풀스캔이 돈다

  왜 이 엔드포인트로 시작하는가
    무인증 / 파라미터 없음 / 읽기 전용 / 부수효과 없음.
    변수가 가장 적어서, 측정값이 이상하면 그건 서비스 문제가 아니라
    측정 절차 문제라고 단정할 수 있다. 회차 1 의 목적은 문제를 많이
    찾는 게 아니라 루프 절차가 제대로 도는지 확인하는 것이다.
    그래서 토큰 CSV 도 쿠키 매니저도 일부러 넣지 않았다.

  램프업 (결정 A6) : 50 → 100 → 200 → 400 RPS, 각 120초
                     (1회차 후 800 계단 제거 — 400 스레드가 8GB 맥을 스왑으로
                      몰아넣어 호스트 CPU 100%, 회차 전체가 무효였다)
  워밍업 (결정 A5) : 20 RPS 로 60초, 집계에서 제외
  knee   (결정 A7) : p95 > 500ms  또는  에러율 > 1%  또는
                     부하 2배에 처리량 1.2배 미만 — 먼저 걸리는 쪽

  == 스레드 수를 왜 목표 RPS 의 절반으로 잡았나 ==
  Little 의 법칙: 필요한 스레드 = 목표 RPS × 응답시간.
  응답이 500ms 까지 늘어나도 목표 RPS 를 채울 수 있는 값이 RPS × 0.5 다.
  더 늘리면 스레드 컨텍스트 스위칭이 호스트 CPU 를 먹어서, 측정하려는
  서버 부하와 부하기 자신의 부하가 섞인다.
  대신 응답이 500ms 를 넘으면 스레드가 상한이 되어 목표 RPS 를 못 채운다.
  그 자체가 knee 신호지만, 원인이 서버인지 스레드 부족인지는
  클라-서버 gap 과 호스트 CPU 로 판별해야 한다.

  == 왜 ConstantThroughputTimer 인가 (1회차에서 바꿈) ==
  처음엔 PreciseThroughputTimer 를 썼는데, 이건 "테스트 시작 시각"을 원점으로
  도착 스케줄을 미리 만들어둔다. 스레드 그룹을 직렬로 돌리면 N번째 그룹은
  한참 늦게 시작하므로 밀린 분량을 시작 직후에 몰아서 쏜다.
  1회차 실측: 계단1(목표 50 RPS)의 첫 30초가 141~153 RPS 였고,
  초과분 약 2,890건은 앞선 워밍업 60초 × 50 RPS = 3,000 과 거의 일치했다.
  ConstantThroughputTimer 는 스케줄이 없고 매 요청마다 지연을 계산하는
  피드백 방식이라 백로그가 생기지 않는다. 대신 정밀도는 조금 낮다.

  == 계단 값을 왜 프로퍼티로 안 뺐나 ==
  타이머의 throughput 은 doubleProp 이라 ${__P(...)} 가 안정적으로
  평가되지 않는다. 조용히 무시되면 "타이머가 안 먹는" 디버깅에 시간을
  쓰게 되므로 값을 직접 박았다.
  계단을 바꾸려면 doubleProp/num_threads/testname 을 함께 고친다.
  (throughput 은 분당 값이다. 50 RPS = 3000/min)
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="S1-participants" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <!-- 핵심: 스레드 그룹을 동시가 아니라 순차로 돌린다. 이게 false 면 5개 계단이 한꺼번에 뜬다 -->
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp>
        <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(scheme,http)}</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">3000</stringProp>
        <!-- 10초. 이걸 넘으면 실패로 집계된다. 무한정 기다리면 knee 가 지연이 아니라
             스레드 고갈로 나타나서 원인이 흐려진다 -->
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="InfluxDB Backend Listener" enabled="true">
        <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="influxdbMetricsSender" elementType="Argument">
              <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
              <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="influxdbUrl" elementType="Argument">
              <stringProp name="Argument.name">influxdbUrl</stringProp>
              <stringProp name="Argument.value">http://${__P(influxHost,localhost)}:8086/write?db=jmeter</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="application" elementType="Argument">
              <stringProp name="Argument.name">application</stringProp>
              <stringProp name="Argument.value">comatching</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="measurement" elementType="Argument">
              <stringProp name="Argument.name">measurement</stringProp>
              <stringProp name="Argument.value">jmeter</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="summaryOnly" elementType="Argument">
              <!-- false 여야 샘플러(=계단)별로 나뉘어 들어온다. true 면 전부 합쳐져서
                   어느 계단에서 무너졌는지 볼 수 없다 -->
              <stringProp name="Argument.name">summaryOnly</stringProp>
              <stringProp name="Argument.value">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="samplersRegex" elementType="Argument">
              <stringProp name="Argument.name">samplersRegex</stringProp>
              <stringProp name="Argument.value">.*</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="percentiles" elementType="Argument">
              <stringProp name="Argument.name">percentiles</stringProp>
              <stringProp name="Argument.value">50;90;95;99</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="testTitle" elementType="Argument">
              <stringProp name="Argument.name">testTitle</stringProp>
              <stringProp name="Argument.value">${__P(testTitle,S1-participants)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="eventTags" elementType="Argument">
              <stringProp name="Argument.name">eventTags</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
      </BackendListener>
      <hashTree/>

      <!-- ================= 워밍업 (집계 제외) =================
           setUp Thread Group 은 serialize 설정과 무관하게 항상 본 그룹들보다 먼저,
           단독으로 실행된다. 여기서 JIT(C1→C2), 클래스 로딩, Hikari 풀 확장,
           Hibernate 쿼리 플랜 캐시, InnoDB 버퍼 풀을 데운다.
           라벨이 WARMUP 이라 summarize.py 와 Grafana 에서 걸러진다. -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="warmup-60s" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="WARMUP" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/participants</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="20 rps" enabled="true">
          <!-- calcMode 4 = 현재 스레드 그룹의 활성 스레드 전체 기준(공유). 분당 값이다 -->
          <intProp name="calcMode">4</intProp>
          <doubleProp><name>throughput</name><value>1200.0</value><savedValue>0.0</savedValue></doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>

      <!-- ================= 계단 1 — 50 RPS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="step1" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="s1-050rps" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/participants</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="50 rps" enabled="true">
          <!-- calcMode 4 = 현재 스레드 그룹의 활성 스레드 전체 기준(공유). 분당 값이다 -->
          <intProp name="calcMode">4</intProp>
          <doubleProp><name>throughput</name><value>3000.0</value><savedValue>0.0</savedValue></doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>

      <!-- ================= 계단 2 — 100 RPS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="step2" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="s1-100rps" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/participants</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="100 rps" enabled="true">
          <!-- calcMode 4 = 현재 스레드 그룹의 활성 스레드 전체 기준(공유). 분당 값이다 -->
          <intProp name="calcMode">4</intProp>
          <doubleProp><name>throughput</name><value>6000.0</value><savedValue>0.0</savedValue></doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>

      <!-- ================= 계단 3 — 200 RPS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="step3" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="s1-200rps" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/participants</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="200 rps" enabled="true">
          <!-- calcMode 4 = 현재 스레드 그룹의 활성 스레드 전체 기준(공유). 분당 값이다 -->
          <intProp name="calcMode">4</intProp>
          <doubleProp><name>throughput</name><value>12000.0</value><savedValue>0.0</savedValue></doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>

      <!-- ================= 계단 4 — 400 RPS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="step4" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="s1-400rps" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/auth/participants</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="400 rps" enabled="true">
          <!-- calcMode 4 = 현재 스레드 그룹의 활성 스레드 전체 기준(공유). 분당 값이다 -->
          <intProp name="calcMode">4</intProp>
          <doubleProp><name>throughput</name><value>24000.0</value><savedValue>0.0</savedValue></doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>